branches/GENESIS/9.0/SUM/htmlDocumentation/RE/tutorial/WPS_GRASS/Execute_TestOperation_Request_POST.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <wps:Execute xmlns:wps="http://www.opengis.net/wps/1.0.0" xmlns:ows="http://www.opengis.net/ows/1.1" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" service="WPS" version="1.0.0">
      <ows:Identifier>TestOperation</ows:Identifier>
      <wps:DataInputs>
        <wps:Input>
          <ows:Identifier>InputRaster</ows:Identifier>
          <ows:Title>Input raster file</ows:Title>
          <ows:Abstract>Input raster file</ows:Abstract>
          <wps:Reference method="GET" mimeType="image/geotiff" xlink:href="http://hrt-11.pisa.intecs.it/raster/currentSpeedModel.tiff"/>
        </wps:Input>
        <wps:Input>
          <ows:Identifier>InputRasterMultiple</ows:Identifier>
          <ows:Title>Input raster Multiple file</ows:Title>
          <ows:Abstract>Input raster Multiple file</ows:Abstract>
          <wps:Reference method="GET" mimeType="image/geotiff" xlink:href="http://hrt-11.pisa.intecs.it/raster/currentSpeedModel.tiff"/>
        </wps:Input>
        <wps:Input>
          <ows:Identifier>InputRasterMultiple</ows:Identifier>
          <ows:Title>Input raster Multiple file</ows:Title>
          <ows:Abstract>Input raster Multiple file</ows:Abstract>
          <wps:Reference method="GET" mimeType="image/geotiff" xlink:href="http://hrt-11.pisa.intecs.it/raster/currentSpeedModel.tiff"/>
        </wps:Input>
        <wps:Input>
          <ows:Identifier>InputRasterNotMandatory</ows:Identifier>
          <ows:Title>Input raster Multiple file not mandatory</ows:Title>
          <ows:Abstract>Input raster Multiple file not mandatory</ows:Abstract>
          <wps:Reference method="GET" mimeType="image/geotiff" xlink:href="http://hrt-11.pisa.intecs.it/raster/currentSpeedModel.tiff"/>
        </wps:Input>
        <wps:Input>
          <ows:Identifier>BoundingBox</ows:Identifier>
          <ows:Title>Bounding Box Input</ows:Title>
          <ows:Abstract>Bounding Box Input</ows:Abstract>
          <wps:Data>
            <wps:BoundingBoxData xmlns:wps="http://www.opengis.net/wps/1.0.0" xmlns:ows="http://www.opengis.net/ows/1.1">
              <ows:LowerCorner xmlns:ows="http://www.opengis.net/ows/1.1">47.35 8.5</ows:LowerCorner>
              <ows:UpperCorner xmlns:ows="http://www.opengis.net/ows/1.1">50.55 14</ows:UpperCorner>
            </wps:BoundingBoxData>
          </wps:Data>
        </wps:Input>
        <wps:Input>
          <ows:Identifier>BoundingBoxMultipleNotMandatory</ows:Identifier>
          <ows:Title>Bounding Box Input Multiple and Not Mandatory</ows:Title>
          <ows:Abstract>Bounding Box Input Multiple and Not Mandatory</ows:Abstract>
          <wps:Data>
            <wps:BoundingBoxData xmlns:wps="http://www.opengis.net/wps/1.0.0" xmlns:ows="http://www.opengis.net/ows/1.1">
              <ows:LowerCorner xmlns:ows="http://www.opengis.net/ows/1.1">0 0</ows:LowerCorner>
              <ows:UpperCorner xmlns:ows="http://www.opengis.net/ows/1.1">90 90</ows:UpperCorner>
            </wps:BoundingBoxData>
          </wps:Data>
        </wps:Input>
        <wps:Input>
          <ows:Identifier>BoundingBoxMultipleNotMandatory</ows:Identifier>
          <ows:Title>Bounding Box Input Multiple and Not Mandatory</ows:Title>
          <ows:Abstract>Bounding Box Input Multiple and Not Mandatory</ows:Abstract>
          <wps:Data>
            <wps:BoundingBoxData xmlns:wps="http://www.opengis.net/wps/1.0.0" xmlns:ows="http://www.opengis.net/ows/1.1">
              <ows:LowerCorner xmlns:ows="http://www.opengis.net/ows/1.1">0 0</ows:LowerCorner>
              <ows:UpperCorner xmlns:ows="http://www.opengis.net/ows/1.1">90 90</ows:UpperCorner>
            </wps:BoundingBoxData>
          </wps:Data>
        </wps:Input>
        <wps:Input>
          <ows:Identifier>InputFormat</ows:Identifier>
          <ows:Title>The input format</ows:Title>
          <ows:Abstract>The format of the raster input file</ows:Abstract>
          <wps:Data>
            <wps:LiteralData>netCDF4</wps:LiteralData>
          </wps:Data>
        </wps:Input>
        <wps:Input>
          <ows:Identifier>OutputDataType</ows:Identifier>
          <ows:Title>The output data type</ows:Title>
          <ows:Abstract>The data type of the raster output file</ows:Abstract>
          <wps:Data>
            <wps:LiteralData>Float32</wps:LiteralData>
          </wps:Data>
        </wps:Input>
        <wps:Input>
          <ows:Identifier>LiteralMultipleNotMandatory</ows:Identifier>
          <ows:Title>LiteralMultipleNotMandatory</ows:Title>
          <ows:Abstract>LiteralMultipleNotMandatory</ows:Abstract>
          <wps:Data>
            <wps:LiteralData>Float32</wps:LiteralData>
          </wps:Data>
        </wps:Input>
        <wps:Input>
          <ows:Identifier>LiteralMultipleNotMandatory</ows:Identifier>
          <ows:Title>LiteralMultipleNotMandatory</ows:Title>
          <ows:Abstract>LiteralMultipleNotMandatory</ows:Abstract>
          <wps:Data>
            <wps:LiteralData>Float32</wps:LiteralData>
          </wps:Data>
        </wps:Input>
      </wps:DataInputs>
      <wps:ResponseForm>
        <wps:ResponseDocument storeExecuteResponse="true" lineage="false" status="true">
          <wps:Output asReference="true" mimeType="image/tiff">
            <ows:Identifier>OutputRaster</ows:Identifier>
          </wps:Output>
          <wps:Output>
            <ows:Identifier>OutputMessage</ows:Identifier>
          </wps:Output>
          <wps:Output>
            <ows:Identifier>BBOX</ows:Identifier>
          </wps:Output>
        </wps:ResponseDocument>
      </wps:ResponseForm>
    </wps:Execute>
  </soapenv:Body>
</soapenv:Envelope>
